@extends('frontend.layouts.base')


@section('content')



<section class="doc">
    <div class="container">




        <h1>Політика конфіденційності</h1>
        <p><strong>Редакція від «30» червня 2025 р.</strong></p>
        <p>
            Ця Політика конфіденційності описує, як <strong>timesecret.com.ua</strong> ( Далі - "Сервіс", TIMESECRET, timesecret.com.ua, "ми", "нами", "нас" ) використовує та передає Інформацію, 
            зібрану нами або надану Вами під час відвідування Веб-сайту, який розміщено за адресом: <a href="{{ route('home') }}">{{ route('home') }}</a>                
        </p>
        <p>
            Власником персональних даних є <strong>timesecret.com.ua</strong>
        </p>
        <p>
            Ця Політика конфіденційності також роз'яснює Ваші права та можливості щодо Ваших персональних Даних, 
            а також те, як Ви можете зв'язатися з нами, щоб внести зміни до Ваших персональних даних або отримати відповіді на питання, 
            які можуть виникнути у Вас щодо наших практик у сфері конфіденційності.
            Положення цієї Політики Конфіденційності можуть бути змінені надалі. 
            Щоразу, коли ми вносимо зміни до цієї Політики конфіденційності, ми опублікуємо її нову редакцію на цій сторінці та вкажемо дату нової редакції.
        </p>
        <p>
            Будь ласка, уважно прочитайте положення цієї Політики Конфіденційності та зв'яжіться з нами електронною поштою, зазначеною в цьому документі, якщо у вас виникнуть запитання. 
            Використовуючи Веб-сайт, отримуючи послуги на Веб-сайті https:://timesecret.com.ua або проставляючи відповідну позначку (наприклад, натискаючи на ― "згоден") 
            ви погоджуєтесь з усіма умовами цієї Політики конфіденційності, підтверджуєте своє ознайомлення з викладеними тут умовами та даєте нам свою вільну та 
            однозначну згоду використовувати Ваші Персональні дані відповідно до умов цієї Політики конфіденційності.
        </p>
        <p></p>




        <h2>Визначення термінів</h2>       
        <p>        
            <strong>Власник персональних даних</strong> - особа, яка визначає мету обробки персональних даних, встановлює склад цих даних та процедури їх обробки, якщо інше не визначено законом.
        </p>       
        <p>
            <strong>Персональні дані</strong> - відомості або сукупність відомостей про фізичну особу, яка ідентифікована або може бути ідентифікована.
        </p>       
        <p>            
            <strong>Неперсональні Дані</strong> - інформація та відомості, які власними силами не дозволяють безпосередньо ідентифікувати конкретну особу.
        </p>      
        <p>     
            <strong>Інформація</strong> - як персональні, так і не персональні дані.
        </p>       
        <p>      
            <strong>Користувач</strong> - фізична особа, яка отримує доступ до Веб-сайту https://timesecret.com.ua, що ним користується та/або здійснює замовлення послуг.
        </p>       
        <p>
            <strong>Обробка</strong> - будь-які дії з персональними даними у тому числі але не виключно: доступ, надання, розповсюдження, збір, систематизація, зберігання, накопичення, запис,
            передача, блокування, видалення, уточнення, оновлення та/або зміна, знеособлення та інші способи використання персональних даних, які здійснюються Сервісом.
        </p>
        <p>
            <strong>Закон</strong> – Закон України "Про захист персональних даних" № 2297-VI.
        </p>




        <h2>1. Загальні положення</h2>
        <p>
            Ми обробляємо Ваші Персональні дані виключно для виконання Вашого замовлення, заявки, доручення та надання необхідної інформації про стан його виконання, участі в рекламних активностях Сервісом, при зверненні до клієнтської підтримки, а також коли Ви підписуйтесь на наші розсилки, берете участь в опитуваннях або залишаєте відгуки про нас.
        </p>
        <p>
            Інформація надана Вами є конфіденційною та не передається третім особам, крім необхідності виконання Вашого замовлення, заявки, доручення та інших випадків, передбачених законодавством.
        </p>
        <p>
            Положення цієї Політики Конфіденційності застосовуються лише до Веб-сайту. Сервіс не контролює та не несе відповідальності за сайти третіх осіб, на які Користувач може перейти за посиланнями, доступними на Сайті.
        </p>
        <p>
            Будь ласка, зверніть увагу, що Сервіс не перевіряє правдивість інформації, наданої Користувачем.
        </p>
        <p>
            Також ми збираємо Неперсональні данні щодо пристрою з якого Користувач зайшов на сайт.
        </p>
        <p>
            Інформація про Вас обробляється з моменту Вашого входу на сайт та початку користування Сайтом, а також з моменту отримання Сервісом Ваших персональних даних, надісланих електронною поштою, через сайт або наданих через інші засоби комунікацій.
        </p>




        <h2>2. Інформація, яку ми можемо збирати або отримати</h2>       
        <p>
            Ми не збираємо інформацію, що зберігається у вашому секреті. Інформація у вашому секреті належить вам, і ви несете за неї відповідальність.           
        </p>
        <p>
            Інша інформація може бути надана користувачем виключно на його розсуд (крім випадків, якщо така інформація потрібна для забезпечення можливості виконання договору або її надання передбачене законодавством).
        </p>
        <p>
            Крім того, ми використовуємо технологію cookie та зчитування відкритої інформації з User agent для збору додаткових даних про пристрій Користувача, використання сайту та для покращення роботи сайту, підвищення якості наших послуг.
        </p>
        <p>
            Cookie-файли - це невеликі файли, які Сайт, сервіси мережного програмного забезпечення або постачальники послуг розміщують у пристрої через Веб-браузер (якщо це дозволено Вами), що дозволяє сайту або постачальникам послуг розпізнавати Ваш браузер і зберігати та запам'ятовувати певну інформацію.
        </p>
        <p>
            За допомогою cookie-файлів ми можемо обробляти таку інформацію як:
        </p>
        <ul>
            <li>
                дані про пристрій: апаратна модель, унікальні ідентифікатори пристрою, MAC-адреса, IP-адреса, версія операційної системи та налаштування пристрою;
            </li>
            <li>
                інформацію з Log-файлів: час та тривалість використання сайту, пошукові запити, інформація про місцезнаходження та будь-яка інша інформація, що зберігається у Cookie-файлах, що дозволяє однозначно ідентифікувати Ваш браузер або обліковий запис;
            </li>
            <li>
                інші дані: дані про використання Вами сайту, які ми можемо обробляти, якщо Ви відвідуєте або використовуєте сторонні Веб-сайти або програми для зв'язку з нами, про те, як Ви взаємодієте з контентом, розміщеним на Веб-сайті.
            </li>
        </ul>
        <p>
            Ми використовуємо Cookie-файли для багатьох важливих речей - наприклад, щоб допомогти Вам увійти в систему і щоб покращити Ваш досвід користування нашим Веб-сайтом. Ми можемо використовувати Cookie-файли для того, щоб краще зрозуміти як Ви взаємодієте з Веб-сайтом, відстежувати загальну кількість користувачів Веб-сайту та/або Програми та маршрутизацію веб-трафіку на Веб-сайті, удосконалювати Веб-сайт, щоб зрозуміти Ваші уподобання на основі попередньої або поточної активності на Веб-сайті, що дозволить нам надавати Вам послуги вищої якості.
        </p>
        <p>
            User agent — це ідентифікаційний рядок клієнтської програми в пристрої клієнта, що прописаний виробником для відкритого та легального надання інформації про пристрій, в т.ч. для веб-сайтів — браузерів.
        </p>
        <p>
            Під час відвідування веб-сайту клієнтська програма зазвичай надсилає веб-серверу інформацію про себе — текстовий рядок, що є частиною HTTP-запиту і зазвичай включає таку інформацію, як назву та версію програми, операційну систему пристрою, мову та інше.
        </p>
        <p>
            Ми не збираємо і просимо Вас не надавати нам будь-яку Інформацію, щодо обробки якої Законом встановлено певні обмеження та вимоги, а саме - інформацію про расове чи етнічне походження, про політичні, релігійні чи світоглядні переконання, про членство в політичних партіях та професійних спілках, судимості у кримінальних справах або про підозру у скоєнні злочинів у кримінальних справах, а також дані щодо здоров'я, статевого життя, біометричних та генетичних даних.
        </p>




        <h2>3. Як ми можемо використовувати персональні дані</h2>
        <p>
           Ми можемо використовувати інформацію, зібрану нами, як описано вище, з наступною метою: 
        </p>
        <p>
            <strong>Договірні відносини.</strong>
            Ми можемо опрацьовувати Ваші Персональні Дані для виконання договірних зобов'язань - передачі інформації про Вас Постачальникам послуг, для оформлення Вашого замовлення, заявки, доручення.
        </p>        
        <p>
            <strong>Запити та інші комунікації.</strong>
            У випадку, якщо Ви зв'язалися з нами через наші контактні форми та/або електронною поштою/телефоном, ми можемо обробляти Інформацію, яку Ви нам надали, щоб мати можливість відповісти на ваше запитання, скаргу чи запит.
        </p>
        <p>
            <strong>Маркетинг.</strong>
            Ми можемо використовувати Інформацію, отриману від Вас (наприклад, вашу електронну пошту) для маркетингових цілей. Наприклад, підписавшись на нашу розсилку новин, Ви можете отримувати публікації та оголошення прямо на свою електронну пошту. Ми можемо надсилати Вам рекламні матеріали щодо наших акційних пропозицій, які, на нашу думку, можуть Вас зацікавити.
        </p>
        <p>
            Ви можете відмовитися від отримання наших маркетингових електронних розсилок (як повністю, так і частково), натиснувши на посилання "скасувати розсилку" в електронних листах, які Ви отримуєте від нас. Крім того, для того, щоб скасувати передплату, Ви можете в будь-який момент зв'язатися з нами, відправивши нам повідомлення на адресу електронної пошти, зазначену в цій Політиці конфіденційності.
        </p>
        <p>
            Ми також можемо використовувати Інформацію, отриману за допомогою Cookie-файлів з метою проведення маркетингових досліджень, для аналізу характеристик користувачів сайту, оцінки ефективності нашого маркетингового зв'язку та для пристосування до існуючих тенденцій, для планування наших майбутніх маркетингових кампаній, бізнес-аналітики, персоналізації сервісів та комунікацій для Вас.
        </p>
        <p>
            <strong>Захист наших інтересів, безпека.</strong>
            Ми можемо використовувати Ваші персональні дані, коли вважаємо за необхідне вжиття заходів щодо запобігання можливому настанню відповідальності, для здійснення розслідувань та захисту Сервісом від будь-яких претензій чи звинувачень третіх осіб, розслідувань та захисту Сервісом від шахрайства, захисту безпеки чи цілісності Веб-сайту та захисту прав власності нашої Сервісом, користувачів та/або партнерів.
        </p>
        <p>
            <strong>Відповідність вимогам Закону.</strong>
            Ми також можемо використовувати/розкривати Вашу інформацію, зібрану нами, щоб відповідати законодавчим вимогам, галузевим стандартам та нашій політиці. Ми можемо розкривати Вашу Інформацію у ситуаціях, які, на нашу думку: (1) є надзвичайними ситуаціями, пов'язаними з потенційною загрозою фізичній безпеці будь-якої особи чи майна, якщо ми вважаємо, що Ваша Інформація будь-яким чином пов'язана з такою загрозою; (2) є пов'язаним з незаконним або невідповідним, на нашу думку, використанням Сайту.
        </p>
        <p>
            <strong>Обробка інформації включає:</strong>            
        </p>
        <p>            
            Збирання, накопичення, зберігання, адаптування, перевірка, зміна, відновлення, використання, знеособлення, знищення персональних даних, у тому числі з використанням інформаційних (автоматизованих) систем.
            Збір персональних даних може відбуватися в усній, письмовій та/або електронній формі шляхом запитів або самостійного надання Вами необхідних відомостей та документів. Персональні дані накопичуються та зберігаються в письмовій та/або електронній формі.
        </p>




        <h2>4. Як ми можемо передавати персональні дані</h2>
        <p>
            Ми приділяємо особливу увагу конфіденційності та захисту Ваших Персональних Даних. Інформація надана Вами є конфіденційною і не передається третім особам, крім випадків, передбачених законодавством.
        </p>
        <p>
            Ми можемо розкривати Ваші Персональні Дані, якщо цього вимагає Закон або з метою виконання юридичного зобов’язання або якщо ми впевнені, що такі дії необхідні для:
        </p>
        <ul>
            <li>
                для розслідування, реагування та захисту відносно претензій;
            </li>
            <li>
                якщо це необхідно у судовому процесі (в тому числі й задля виклику до суду);
            </li>
            <li>
                для захисту прав та власності Адміністратора або третіх осіб;
            </li>
            <li>
                для запобігання можливого настання відповідальності;
            </li>
            <li>
                у цілях громадської безпеки або безпеки окремих осіб;
            </li>
            <li>
                з метою запобігання або припинення будь-якої незаконної, неетичної, шахрайської, образливої та іншої діяльності, що може призвести до негативних юридичних наслідків; для цілісності та безпеки Сайту, наших послуг та будь-якого обладнання, що використовується у роботі Сайту та при наданні послуг;
            </li>
            <li>
                для дотримання вимог чинного законодавства.
            </li>
        </ul>





        <h2>5. Як ми зберігаємо і захищаємо ваші персональні дані</h2>
        <p>
            Захист ваших Персональних Даних є надзвичайно важливим для нас, тому ми вживаємо всіх необхідних заходів для цього. Ми зберігаємо Персональні Дані Користувачів у безпечних умовах. Ваші Персональні Дані захищені від несанкціонованого доступу, розкриття, використання, зміни чи знищення.
        </p>
        <p>
            Адміністратор на постійній основі здійснює контроль за прийнятими заходами щодо забезпечення безпеки.
        </p>
        <p>
            Ми зберігатимемо Ваші Персональні Дані протягом періоду, коли вони є необхідними для надання Вам доступу до Сайту та / або задля виконання наших юридичних зобов'язань (виконання Ваших замовлень, податкова та фінансова звітність тощо), вирішення спорів та відповідності нашій політиці.
        </p>
        <p>
            Термін зберігання визначається з урахуванням типу зібраної Інформації, і мети, задля якої вона збиралася, залежно від ситуації, і необхідності видалення застарілої, непотрібної Інформації в найкоротший термін.
        </p>
        <p>
            Після того, як Ви припиняєте користування Сайтом та нашими послугами, шляхом видалення свого облікового запису на Сайті, Ваші Персональні Дані також автоматично видаляються (крім випадків, коли ми змушені зберігати такі дані для виконання обов’язків встановлених чинним законодавством України).
        </p>
        





        <h2>6. Права та обов’язки сторін</h2>
        <p>
            У випадку, якщо Ви дізналися, що хтось протиправно надав нам Ваші Персональні Дані, повідомте нас про це якомога швидше за контактними даними, вказаними в цій Політиці Конфіденційності. За Вашим запитом ми видалимо Ваші Персональні Дані у найкоротший термін, у жодному разі не пізніше одного місяця з дня отримання Вашого запиту. Ми збережемо лише такі копії Інформації, які можуть бути необхідні нам з метою дотримання вимог Закону для таких випадків.
        </p>
        <p>
            Крім того, Ви можете у будь-який момент змінити (поновити, доповнити, видалити) надані Вами Персональні Дані або їх частину через власний обліковий запис (якщо ви є зареєстрованим Користувачем Сайту) або звернувшись до нас з відповідним запитом.
        </p>
        <p>
            <strong>Користувач зобов'язаний:</strong>
        </p>

        <ul>
            <li>
                Надати інформацію про персональні дані, необхідну для створення облікового запису.
            </li>
            <li>
                Оновити, доповнити надану інформацію про персональні дані у разі зміни даної інформації.
            </li>
        </ul>
      
        
        <p>
            <strong>Сервіс зобов'язаний:</strong>
        </p>
        <ul>            
            <li>
                Забезпечити зберігання конфіденційної інформації в таємниці, не розголошувати без попереднього дозволу Користувача, а також не здійснювати продаж, обмін, опублікування або розголошення іншими можливими способами переданих персональних даних Користувача, за винятком п. 3. цієї Політики Конфіденційності.
            </li>
            <li>
                Вживати запобіжні заходи для захисту конфіденційності персональних даних Користувача.
            </li>
            <li>
                Здійснити блокування персональних даних, що належать до відповідного Користувача, з моменту звернення або запиту Користувача або його законного представника або уповноваженого органу захисту прав суб'єктів персональних даних на період перевірки, у разі виявлення недостовірних персональних даних або неправомірних дій.
            </li>
        </ul>
        


        {{-- <h2>6. Ваші права</h2>
        <p>
            Стосовно Ваших Персональних Даних, Ви маєте такі права:
        </p>
        <p>
            a) в будь-який час звернутися до володільця персональних даних з будь-якими питаннями та скаргами щодо обробки персональних даних, а також запитати чи обробляються персональні дані та зміст таких персональних даних;
        </p>
        <p>
            b) на безплатний доступ до своїх персональних даних;
        </p>
        <p>
            c) в будь-який час просити володільця персональних даних скасувати чи обмежити обробку персональних даних, а також вимагати внесення змін до персональних даних, якщо в них наявні неточності або вони втратили актуальність;
        </p>
        <p>
            d) в будь-який час просити володільця персональних даних видалити персональні дані в тому обсязі, в якому вони більше не потрібні для досягнення вказаних в цьому повідомленні цілей або інших цілей, в яких володільцю необхідно продовжувати їх обробку, або коли володілець персональних даних більше немає законного права обробляти їх;
        </p>
        <p>
            e) в будь-який час відкликати свою згоду на обробку персональних даних;
        </p>
        <p>
            f) звертатися зі скаргами на обробку персональних даних до Уповноваженого Верховного Ради України з прав людини або до суду;
        </p>
        <p>
            g) знати про джерела збирання, місцезнаходження персональних даних, мету їх обробки, місцезнаходження або місце проживання (перебування) володільця чи
            розпорядника персональних даних або дати відповідне доручення щодо отримання цієї інформації уповноваженим ним особам, крім випадків, встановлених законом;
        </p>
        <p>
            h) отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх осіб, яким передаються персональні дані;
        </p>
        <p>
            i) пред'являти вмотивовану вимогу володільцю із запереченням проти обробки своїх персональних даних;
        </p>
        <p>
            j) на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у зв'язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;
        </p>
        <p>
            k) застосовувати засоби правового захисту в разі порушення законодавства про захист персональних даних;
        </p>
        <p>
            l) вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;
        </p>
        <p>
            m) знати механізм автоматичної обробки персональних даних;
        </p>
        <p>
            n) на захист від автоматизованого рішення, яке має для нього правові наслідки.
        </p>
        <p>
            Якщо Ви бажаєте скористатися будь-яким з вищезазначених прав або отримати додаткову інформацію, будь ласка, зв'яжіться з нами за реквізитами, які вказано нижче у цій Політиці Конфіденційності.
        </p>
        <p>
            Проте, будь ласка, зверніть увагу, що ці права не є абсолютними, і можуть дещо обмежуватися нормативними вимогами та нашими законними інтересами.
        </p>
        <p>
            Щоб відповісти на Ваш запит, ми повинні ідентифікувати Вашу особу, аби Ваша Інформація не була надана не уповноваженій особі.
        </p>
        <p>
            Адміністратор протягом десяти днів з моменту отримання Вашого запиту має надати Вам інформацію про дії, вжиті у зв'язку з Вашим запитом. Термін надання остаточної відповіді на Ваш запит – до 30 днів з моменту отримання запиту. Однак, для третіх осіб час відповіді на запит може бути продовжено до 45 днів з моменту отримання запиту.
        </p>
        <p>
            У випадку, якщо Ви дізналися, що хтось протиправно надав нам Ваші Персональні Дані, повідомте нас про це якомога швидше за контактними даними, вказаними в цій Політиці Конфіденційності. За Вашим запитом ми видалимо Ваші Персональні Дані у найкоротший термін, у жодному разі не пізніше одного місяця з дня отримання Вашого запиту. Ми збережемо лише такі копії Інформації, які можуть бути необхідні нам з метою дотримання вимог Закону для таких випадків.
        </p>
        <p>
            Крім того, Ви можете у будь-який момент змінити (поновити, доповнити, видалити) надані Вами Персональні Дані або їх частину через власний обліковий запис (якщо ви є зареєстрованим Користувачем Сайту) або звернувшись до нас з відповідним запитом.
        </p> --}}




        <h2>7. Діти</h2>
        <p>
            Ми розуміємо, наскільки важливим є вжиття додаткових заходів для захисту приватності та безпеки дітей, які користуються Сайтом. Дітям до 18 років не дозволяється використовувати наш Веб-сайт, якщо їхні батьки не дали на це своєї згоди, що має підтверджуватись відповідними доказами. Ми не збираємо цілеспрямовано Персональні дані дітей віком до 18 років.
        </p>
        <p>
            Якщо ми дізнаємося, що ми отримали Персональні Дані дитини віком до 18 років, за винятком вищезгаданих обставин, ми вживемо всіх необхідних заходів для того, щоб видалити таку Інформацію якнайшвидше, тільки якщо ми не зобов'язані зберігати такі дані з метою дотримання вимог закону.
        </p>




        <h2>8. Оновлення цієї політики</h2>
        <p>
            Щоразу, коли ми вносимо зміни до цієї Політики конфіденційності, нова версія буде доступна на Веб-сайті з новою датою редакції.
        </p>
        <p>
            Ви можете отримати доступ до нової редакції Політики Конфіденційності з того самого дня, коли вона набирає чинності, тому Ви маєте час, щоб прийняти рішення про подальше користування сайтом та для направлення своїх заперечень щодо змін в обробці Ваших персональних даних. Проект нової політики конфіденційності може бути опублікований заздалегідь.
        </p>





        <h2>9. Права третіх осіб</h2>
        <p>
            Для забезпечення виконання зобов'язань перед користувачами, Сервіс може здійснювати передачу даних про Користувачів Постачальникам і навпаки, але виключно в межах як це необхідно для виконання відповідних послуг, які здійснені на Веб-сайті.
        </p>




        <h2>10. Питання та скарги</h2>
        <p>
            Якщо у Вас виникли питання, занепокоєння чи скарги щодо наших методів збору та обробки Ваших Персональних даних, або якщо у Вас є якісь пропозиції чи питання щодо цієї Політики Конфіденційності, зв'яжіться з нами.
        </p>





        <h2>11. Як з нами зв'язатись</h2>
        <p>
            <strong>TIMESECRET</strong>
        </p>
        <p>Email: <a href="mailto:support@timesecret.com.ua">support@timesecret.com.ua</a></p>



    </div>
</section>


@endsection