<?php

return [
    'csrf_token_mismatch' => 'Минув час сесії. Будь ласка, оновіть сторінку та спробуйте ще раз.',
    'too_many_attempts' => 'Забагато спроб. Зачекайте дві хвилини та спробуйте ще раз.',

    'email_already_registered' => 'Користувач з такою поштою вже зареєстрований.',
    'error_sending_email' => 'Помилка відправки e-mail. Спробуйте ще раз.',
    'send_code_success' => 'Код підтвердження успішно надіслано!',

    'invalid_verification_code' => 'Невірний код підтвердження. Отримайте новий код.',

    'success_registration' => 'Успішна реєстрація!',
    'error_registration' => 'Помилка реєстрації. Спробуйте ще раз.',

    'email_not_registered' => 'Користувач з таким e-mail не зареєстрований.',

    'forgot_error_occurred' => 'Сталася помилка. Будь ласка, спробуйте ще раз.',

    'error_token_expires' => 'Закінчився термін дії посилання. <br> Отримайте нове посилання для відновлення паролю.',
    'error_forgot' => 'Отримайте нове посилання для відновлення паролю.',
    'error_passphrase' => 'невірна парольна фраза'

];