<?php

return [
    'home' => [
        'title' => 'Тимчасовий секрет',
        'desc' => 'Не залишайте сліди в Інтернеті. Сервіс для безпечного обміну конфіденційною інформацією. Створити тимчасовий секрет.',
    ],
    'about' => [
        'title' => 'Про сервіс | Тимчасовий секрет',
        'desc' => 'Сервіс створений для безпечного обміну конфіденційною інформацією. Інформація зберігається тимчасово та доступна лише для одного перегляду.',
    ],
    'feedback' => [
        'title' => "Зворотний зв'язок | Тимчасовий секрет",
        'desc' => "Залишити відгук. Поділіться своїми думками чи досвідом. Зворотний зв'язок",
    ],
    'secret' => [
        'title' => 'Ваш тимчасовий секрет',
        'desc' => 'Ваш тимчасовий секрет',
    ],

    'pass-reset' => [
        'title' => 'Зміна пароля',
        'desc' => 'Зміна пароля',
    ],

    'privacy' => [
        'title' => 'Політика конфіденційності',
        'desc' => 'Політика конфіденційності. Сервіс для безпечного обміну конфіденційною інформацією.',
    ],
    'terms' => [
        'title' => 'Умови використання',
        'desc' => 'Умови використання. Сервіс для безпечного обміну конфіденційною інформацією.',
    ],


];