@extends('frontend.layouts.base')


@section('content')



<section class="doc">
    <div class="container">
        <h1 class="doc__title title-h1">Умови використання</h1>
        <p><strong>Редакція від «30» червня 2025 р.</strong></p>
        <p>
            Ці умови використання є договором - договором оферти. Усі його умови однакові для всіх користувачів незалежно від статусу і організаційно-правової форми.
        </p>
        <p>
            Умови використання поширюються на доступ та використання Веб-сайту <a href="{{ route('home') }}">{{ route('home') }}</a> (Далі за текстом — Веб-сайт, timesecret.com.ua, TIMESECRET, Сервіс, «ми», «нас», «наш»).
        </p>
        <p>
            Завантажуючи, використовуючи Веб-сайт, переглядаючи, відправляючи контент або використовуючи інший доступ, Користувач (Далі за текстом — «Ви», «Вас», «Вам», «Ваше») погоджується з цими умовами, наведеними нижче. Якщо ви не бажаєте погоджуватися з усіма цими умовами використання та політикою конфіденційності, припиніть використання нашого сервісу.
        </p>




        <h2>Мінімальний вік</h2>
        <p>
            Послуги на Веб-сайті доступні тільки особам, які досягли повноліття відповідно до законодавства країни-резидента або громадянином якої така особа є і здатна укладати юридично зобов'язуючі договори відповідно до чинного законодавства. Не обмежуючи вищезазначене, Веб-сайт не призначений для використання неповнолітніми особами. Якщо ви не відповідаєте цим вимогам, будь ласка, не заходьте на Веб-сайт.
        </p>
        <p>
            Будь-яке подальше використання Веб-сайту або будь-якої його частини означає, що ви прочитали та зрозуміли Умови використання та Політику конфіденційності та погоджуєтесь дотримуватись усіх розділів Умов використання та Політики конфіденційності.
        </p>




        <h2>Зміни в умовах використання</h2>
        <p>
            Положення цих умов використання можуть бути надалі змінені. Щоразу, коли ми вносимо зміни до цих умов використання, ми опублікуємо її нову редакцію на цій сторінці та вкажемо дату нової редакції.
        </p>
        <p>
            Будь-які зміни в цих Умовах набувають чинності негайно після їх публікації. 
        </p>
        <p>
            Продовження використання вами Сервісу після внесення змін до цих Умов означає вашу згоду з цими змінами. Якщо ви не бажаєте погоджуватися з будь-якими змінами цих Умов, негайно припиніть використання Веб-сайту.
        </p>
        



        <h2>Терміни та визначення</h2>
        <p>
            <strong>Сервіс</strong> - відноситься до додатків, програмного забезпечення, продуктів та послуг, що надаються Веб-сайтом https://timesecret.com.ua
        </p>
        <p>
            <strong>Послуги TIMESECRET</strong> - відносяться до послуг, які базуються на технологіях Інтернет та пропонуються через Веб-сайт https://timesecret.com.ua, а також інші форми (включаючи нові, які стануть можливими завдяки майбутньому технологічному розвитку).
        </p>
        <p>
            <strong>Користувач</strong> – будь-яка фізична чи юридична особа, яка користується Веб-сайтом https://timesecret.com.ua.
        </p>
        <p>
            <strong>Контент</strong> - відноситься до контенту, представленого або відображуваного через Веб-сайт, включаючи текст, дані, статті, зображення, фотографії, графіку, програмне забезпечення, додатки, дизайн, функції та інші матеріали, які доступні на Веб-сайті або іншим чином доступні через Сервіс.
        </p>
        <p>
            <strong>Контент користувача</strong> - це Контент, написаний або завантажений Користувачами.
        </p>
        <p>
            <strong>Тимчасовий секрет</strong> - це контент користувача, який тимчасово зберігається у сервісі.
        </p>
        <p>
            <strong>Адміністратор</strong> - TIMESECRET
        </p>
        <p>
            <strong>Адміністрація</strong> - співробітники Адміністратора, які здійснюють управління Веб-сайтом https://timesecret.com.ua, виконують технічні, організаційні та інші функції щодо забезпечення функціонування сервісів Веб-сайту https://timesecret.com.ua,  а також надають інформаційну, консультаційну та іншу підтримку користувачеві та Веб-сайту https://timesecret.com.ua. 
        </p>




        <h2>Безпека облікового запису користувача</h2>
        <p>
            Ви несете відповідальність за безпеку свого облікового запису та пароля.
        </p>
        <p>
            Ви несете відповідальність за весь розміщений контент та дії, які відбуваються під вашим обліковим записом.
        </p>
        <p>
            timesecret.com.ua не нестиме відповідальності за будь-які збитки або збитки, що виникли внаслідок недотримання вами цього зобов'язання щодо забезпечення безпеки.
        </p>
        <p>
            Ви негайно повідомите timesecret.com.ua , якщо вам стане відомо про будь-яке несанкціоноване використання або доступ до нашого Сервісу через ваш обліковий запис.
        </p>




        <h2>Видалення облікового запису</h2>
        <p>
            Ви можете скасувати свій обліковий запис у будь-який час, надіславши електронний лист з вашої пошти, яка зареєстрована у Сервісі на адресу support@timesecret.com.ua.
        </p>




        <h2>Припинення використання послуг</h2>
        <p>
            TIMESECRET має право призупинити або припинити ваш доступ до всього Сайту або будь-якої його частини в будь-який час, із зазначенням причини або без неї, з повідомленням або без нього, причому рішення набуває чинності негайно. timesecret.com.ua залишає за собою право відмовити у наданні послуг будь-якій особі з будь-якої причини у будь-який час.
        </p>




        <h2>Тимчасове обмеження функціональності сайта</h2>
        <p>
            З метою безпеки, після кількох невдалих спроб ми тимчасово блокуємо для користувача доступ до функціональності Сервісу таких як:
        </p>
        <ul>
            <li>
                реєстрація
            </li>
            <li>
                автентифікація (вхід)
            </li>
            <li>
                відновлення паролю
            </li>
            <li>
                перегляд тимчасового секрету
            </li>
        </ul>




        <h2>Заборонене використання</h2>
        <p>
            Ви погоджуєтесь не завантажувати, не публікувати, не розміщувати або передавати будь-який контент, який:
        </p>
        <ul>
            <li>
                є незаконним чи пропагує незаконну діяльність;
            </li>
            <li>
                є чи містить сексуально непристойний контент;
            </li>
            <li>
                є образливим чи шахрайським;
            </li>
            <li>
                порушує будь-які права власності будь-якої сторони, включаючи патент, товарний знак, комерційну таємницю, авторські права, декларація про публічність чи інші права.
            </li>
        </ul>
        <p>
            Ви погоджуєтесь не завантажувати, не розміщувати, не надсилати електронною поштою або іншим чином не передавати будь-які матеріали, які містять програмні віруси або будь-який інший комп'ютерний код, файли або програми, призначені для того, щоб переривати, шкодити, пошкоджувати, знищувати або обмежувати функціональність будь-якого комп'ютерного програмного забезпечення чи апаратного забезпечення, чи обладнання, прямо чи опосередковано пов'язаного з Веб-сайтом. Ви погоджуєтесь не втручатися в роботу серверів або мереж, що лежать в основі або пов'язаних з даним Веб-сайтом, а також не порушувати будь-які процедури, політики або правила мереж, підключених до Веб-сайту.
        </p>
        <p>
            Ви погоджуєтесь не дозволяти будь-якій третій стороні копіювати, адаптувати, реконструювати, декомпілювати, дизасемблювати, змінювати або виправляти помилки на сайті https://timesecret.com.ua повністю або частково, не піддавати зворотному інжинірингу або створювати похідні роботи на основі всього або будь-якої частини програми TIMESECRET та\або Веб-сайту. Веб-сайт може містити певне стороннє програмне забезпечення, плагіни або інтерфейс додатків (спільно звані «Стороннє програмне забезпечення»), для яких потрібні окремі Умови угоди. 
        </p>
        <p>
            Ви погоджуєтесь не видавати себе або намагатися видати себе за сервіс TIMESECRET, співробітника TIMESECRET, іншого користувача або будь-яку іншу фізичну чи юридичну особу (включаючи, крім іншого, використання адрес електронної пошти або псевдонімів, пов'язаних з будь-яким із вищевикладеного).
        </p>
        <p>
            Ви погоджуєтесь не передавати або забезпечувати надсилання будь-яких рекламних або маркетингових матеріалів без нашої попередньої письмової згоди, включаючи будь-яку «небажану пошту», «листи щастя», «спам» або будь-які інші подібні запити.
        </p>




        <h2>Контент користувача</h2>
        <p>
            Ви володієте контентом, який ви створюєте, але ви надаєте нам певні права на нього, щоб ми могли відображати контент, який ви публікуєте.
        </p>
        <p>
            Користувач сам вирішує кому надати доступ до своєї інформації, надсилаючи посилання на створений тимчасовий секрет.
        </p>




        <h2>Тимчасовий секрет</h2>
        <p>
            Тимчасовий секрет зберігається у зашифрованому вигляді та видаляється із сервісу назавжди після першого перегляду або після закінчення терміну зберігання.
        </p>
        <p>
           Терміни зберігання: 
        </p>
        <ul>
            <li>
               Анонімне використання – 3 дні; 
            </li>
            <li>
                Зареєстрований користувач – від 5 хвилин до 7 днів, обирається користувачем під час створення секрету.
            </li>
        </ul>




        <h2>Відповідальність за контент користувача</h2>
        <p>
            Під час використання Сервісу Ви можете створювати або завантажувати контент користувача.
        </p>
        <p>
            Ви несете повну відповідальність за зміст і за будь-яку шкоду, що виникає в результаті будь-якого контенту користувача, який ви публікуєте, завантажуєте, посилаєтеся або іншим чином робите доступним через Сервіс, незалежно від форми цього Контенту. 
        </p>
        <p>
            Ми не несемо відповідальності за публічний показ або неправильне використання вашого контенту користувача.
        </p>




        <h2>TIMESECRET може видалити контент користувача</h2>
        <p>
           Ми не проводимо попередньої перевірки контенту користувача, але маємо право відхилити або видалити будь-який контент користувача, який, на наш власний розсуд, порушує будь-які умови користування або політику конфендиційності TIMESECRET. 
        </p>
        




        <h2>Права інтелектуальної власності</h2>
        <p>
            Сукупність програм, даних, торгових марок, об'єктів інтелектуальної власності у тому числі об'єктів авторського права та інших об'єктів, що використовуються на Веб-сайті, є інтелектуальною власністю його законних правовласників та охороняються законодавством про інтелектуальну власність, а також відповідними міжнародними правами та конвенціями.
        </p>
        <p>
            Будь-яке використання елементів, що входять до складу Веб сайту (символіка, текст, графічні зображення, програми та інші об'єкти), крім дозволеного в цьому Документі, без дозволу є незаконним і може спричинити судовий розгляд та залучення до цивільно-правової, адміністративної. та кримінальної відповідальності відповідно до законодавства.
        </p>
        <p>
            Якщо Ви є власником торгової марки та/або інших об'єктів інтелектуальної власності та вважаєте, що матеріали, розміщені на Веб-сайті, порушують ваші права, будь ласка, напишіть нам на електронну адресу: support@timesecret.com.ua  
        </p>
        <p>
            У зверненні, будь ласка, вкажіть таку інформацію:
        </p>
        <ul>
            <li>
                ідентифікуйте себе (ім'я, адреса для листування, електронна пошта);
            </li>
            <li>
                опишіть характер порушення прав інтелектуальної власності та ідентифікуйте відповідний об'єкт інтелектуальної власності на Веб-сайті.
            </li>
        </ul>




        <h2>Положення на опубліковану інформацію</h2>
        <p>
            Інформація, яка представлена на Веб-сайті https://timesecret.com.ua або через нього, надається виключно для загальних інформаційних цілей. Ми не гарантуємо точність, повноту чи корисність цієї інформації. Ми знімаємо з себе будь-яку відповідальність, що виникає у зв'язку з використанням таких матеріалів вами або будь-яким іншим відвідувачем Веб-сайту, або будь-якою особою, яка може бути поінформована про його зміст.
        </p>




        <h2>Посилання на Веб-сайт та функції соціальних мереж</h2>
        <p>
            Ви можете посилатися на наш Веб-сайт, за умови, що ви робите це чесно та законно, не завдаєте шкоди нашій репутації або не користуєтеся нею, але ви не повинні встановлювати посилання таким чином, щоб пропонувати будь-яку форму асоціації або схвалення з нашого боку, без нашої явної письмової згоди.  
        </p>
        <p>
            Якщо на веб-сайтах є посилання на інші сайти та ресурси, надані третіми сторонами, ці посилання надаються лише для вашої зручності. Сюди входять посилання, що містяться в рекламних оголошеннях, включаючи рекламні банери та спонсорські посилання. Ми не контролюємо вміст цих сайтів чи ресурсів і не несемо відповідальності за них чи за будь-які збитки, чи збитки, які можуть виникнути внаслідок їх використання вами. Якщо ви вирішите отримати доступ до будь-якого зі сторонніх веб-сайтів, пов'язаних з цим Веб-сайтом, ви робите це виключно на свій ризик і відповідно до умов використання таких Веб-сайтів.            
        </p>




        <h2>Обмеження відповідальності</h2>
        <p>
            TIMESECRET докладатиме всіх розумних зусиль для належної роботи Веб-сайту https://timesecret.com.ua, однак не нестиме відповідальності перед Користувачем або третіми особами за прямі та/або непрямі збитки, включаючи втрачену вигоду або втрачені дані, шкода честі, гідності та ділової репутації, понесені у зв'язку з використанням Веб-сайту https://timesecret.com, або неможливості використання, або несанкціонованого доступу до комунікацій Користувача третіми особами, або неможливість отримання послуг, зокрема, наступних випадках:
        </p>
        <ul>
            <li>
                за наявності технологічних несправностей каналів зв'язку загального користування або втрати доступу до мережі Інтернет - до усунення несправностей або відновлення доступу відповідно;
            </li>
            <li>
                за наявності ознак несанкціонованого доступу до управління обліковим записом Користувача на строк дії таких обставин;
            </li>
            <li>
                у разі порушення безпеки обладнання або несправності обладнання (персонального комп'ютера, смартфона), який використовується Користувачем для отримання послуг на Веб-сайті https://timesecret.com.ua. 
            </li>
        </ul>
        <p>
            TIMESECRET не несе відповідальності за будь-які збитки, які виникли у Користувача внаслідок того, що Користувач не ознайомився або несвоєчасно ознайомився з умовами, викладеними в цій угоді.
        </p>
        <p>
            Користувач погоджується, що умови обмеження відповідальності, викладені вище, відображають розумний і справедливий розподіл ризиків. Щоб уникнути неправильного тлумачення положень про обмеження відповідальності, сторони прямо зазначають, що Користувачеві не буде відмовлено в будь-яких законних правах або правах, які виникають у зв'язку з договірними відносинами між Користувачем та TIMESECRET.
        </p>
        <p>
            Сторони звільняються від відповідальності за затримку та/або часткове або повне невиконання зобов'язань за цією Угодою, якщо це невиконання стало наслідком обставин непереборної сили (Форс-мажор), які знаходяться поза контролем сторін, та подолати які розумними методами неможливо.
        </p>




        <h2>Відмова від гарантій</h2>
        <p>
            TIMESECRET надає Веб-сайт та Сервіс «як є» та «як доступно», без будь-яких гарантій. Не обмежуючи це, ми прямо відмовляємося від усіх гарантій, будь то явних, які розуміються або встановлені законом, щодо Веб-сайту та Сервісу, включаючи без обмежень будь-які гарантії товарної придатності, придатності для певної мети, права власності, безпеки, точності та непорушення прав.
        </p>
        <p>
            Ви усвідомлюєте та розумієте, що ми не можемо гарантувати і не гарантуємо, що файли, доступні для завантаження з Інтернету або з веб-сайтів, не міститимуть вірусів або іншого деструктивного коду. Ви несете відповідальність за впровадження достатніх процедур та контрольних точок для задоволення ваших конкретних вимог до антивірусного захисту та точності введення та виведення даних, а також за підтримку зовнішніх по відношенню до нашого сайту засобів для відновлення будь-яких загублених даних.
        </p>




        <h2>Географічні обмеження</h2>
        <p>
            Адміністратор сайту https://timesecret.com.ua знаходиться в Україні. Доступ до Веб-сайту https://timesecret.com.ua може бути незаконним для певних осіб чи певних країн. Якщо ви заходите на Веб-сайт https://timesecret.com.ua з-за меж України, то це відбуватиметься за Вашою власною ініціативою і Ви несете відповідальність за дотримання місцевих законів.
        </p>




        <h2>Регулююче законодавство та юрисдикція</h2>
        <p>
            Всі питання, пов'язані з Веб-сайтом https://timesecret.com.ua та цими Умовами використання, а також будь-які суперечки чи претензії, що виникають з них або пов'язані з ними (у кожному випадку, включаючи позадоговірні суперечки чи претензії), регулюються та тлумачяться відповідно до внутрішнього законодавства України, без здійснення будь-якого вибору чи положення, чи правила колізійного права.
        </p>
        <p>
            Будь-який судовий позов або судовий розгляд, що випливають із цих Умов використання або Веб-сайту https://timesecret.com.ua або пов'язаних з ним осіб, має бути порушено виключно в Україні, хоча ми зберігаємо за собою право подати будь-який позов, або ініціювати судове провадження проти Вас за порушення цих Умов використання в країні Вашого проживання або будь-якої іншої відповідної країни. Ви відмовляєтесь від будь-яких заперечень проти здійснення юрисдикції над Вами такими судами та проти розгляду справи у таких судах.
        </p>




        <h2>Реквізити</h2>
        <p>
            <strong>TIMESECRET</strong>
        </p>
        <p>Email: <a href="mailto:support@timesecret.com.ua">support@timesecret.com.ua</a></p>









    </div>
</section>


@endsection